# language: ru
Функция: Управление корзиной
  Как пользователь интернет-магазина
  Я хочу добавлять товары в корзину
  Чтобы покупать выбранные товары

  Сценарий: Добавление товара в корзину
    Дано пользователь авторизован как "standard_user"
    Когда пользователь добавляет первый товар в корзину
    Тогда счетчик корзины показывает 1

  Сценарий: Добавление нескольких товаров в корзину
    Дано пользователь авторизован как "standard_user"
    Когда пользователь добавляет первый товар в корзину
    И пользователь добавляет второй товар в корзину
    Тогда счетчик корзины показывает 2